{
    "transcript": "Hello, I´m Cris Rúa and... and today I´m gonna talk about user stories. user stories have 3 super important elements card, conversation, and confirmation. This first \"C\" represents the little card. Those are like Post-it that we normally see around... BIG MISTAKE: We try to include all the necessary information in this little card. There is a reason why it is SMALL: Because this card is the one that is gonna help us remember what are we going to talk about before we start the sprint. So, don't include all in it. It's better to keep it in mind, because that is gonna be talked about There's a recommendation to write that card. It's the following: How I, want, to... HOW I: Person who is going to USE the functionality. Not the one who asked for it. The one who is going to use it. WANT... here specifically comes the functionality... I mean, what we are going to do.. And FOR: \"what is the use of this?¨ \"What does this resolve?¨ ---examples--- USER STORIES I'm goint to skip to this last ¨C¨ This last ¨C¨, that means confirmation, is what we commonly call \"ACCEPTANCE CRITERIA\"  what's that? Those are the things that tell me if a user story is finally ready. Each one of these points has to be validated before deliver the user story. Examples: Me, as a person who uses the ATM want to ve able to withdraw the money to have access to my money anywhere. An acceptance criteria could be: The user has to enter a 4-digit PIN Another criteria could be: If the user takes more than... 10 seconds to enter his PIN, the process will be cancelled and he will have to start over. And to put enough to tell that this functionality is well done. It is recommended not to use too many. If you have a lot of criteria, think if maybe you would have to make 2 user stories out of it Remember that the idea is that user stories to be small. and... to generate remembrance of what we are going to do. And now: The most important of all 3 \"C\" : The CONVERSATION Anything that you could not clarify here because you feel you miss something, is what has to be talked about That's the magic of user stories, There´s a lot of exercises that shows that no matter you write on a paper you will never going to clarify as you would wanted. And one minute of conversation, is far more efficient than spend an hour trying to write everything I want and sending it by  mai by  mail. This conversation is face-to-face And here has to be owr \"product owner\", who is the person who is going to clarify everything and is going to answer any question. The conversation is made on the planning where \"product owner\" team is. and in the middle of the conversation, they clarify everithing needed now... for people defining user stories... that is normally the \"product owner\" Am I right? We have the  \"invest\" model. That is what helps when you are defining how do I divide them, how do I separate them How big I left one or another, How do I do to divide one from another... And we have that this model is: each user story has to comply with the following: It has to be independent. Independent means It doesn't need another to function. or at least don't program 2 dependent stories for the same sprint, if you tell a group of people you have to sand and paint an apartment during the same sprint, the person who paint will have to wait the person who sands. to be able to do his work. That's why stories as to be as independent as possible. Negotiable... Don't deliver it that finished, That´s why user story is small You take what is going to be talked about and in the middle of the conversation, better things could come up... that even the development team could see and you had not see it. For that, in the middle of the planning, you could agree to include or take out things... Valuable: That a user story doesn't depend on another to generate value. \nEstimable: That the team can say what is the trouble that this user story has compared to others...\nto be able to tell how many can they deal with during the sprint. That is to estimate.\nSmall. Small Firstly, a user story has to fit in a sprint and secondly, It shouldn't be on the limit that a person takes a whole sprint doing it, \nbecause they are going to Take the risk of not finishing \nit in that same sprint That's why it is recommended\n doing it as small as possible. And, testable:\n That a person can say when the story is ready and he can verify it.\nbe playing with this is not easy.\nFor example... getting a user story to be valuable and being small at the same time, \nis a very important game. \nBecause of that, we have the product owner role, That is most part of his job: To create user stories, keep them clear, \nkeep its acceptance... criteria clear.\nbe present to talk about them.\nA user story will hardly be well made if we don't have a\nproduct owner role in charge of\ndoing them. And doing them very well! That's to create a a user story, a little summarized.\nGo and study each one of this topics that are going to help you in your day-to-day \nto be always improving. I hope you liked this video,\nand that it helps in your teams to be improving each time. Subscribe here at the bottom, \nand click on the little bell. so YouTube tell you when I upload another video. Have a nice day!\nBye bye!"
}